 Том в устройстве C не имеет метки.
 Серийный номер тома: 08B4-FC69

 Содержимое папки C:\Users\NasSm\дз по эвм

02.10.2021  18:20    <DIR>          .
02.10.2021  18:20    <DIR>          ..
02.10.2021  18:20                 0 02.10.1.txt
13.09.2021  00:22    <DIR>          1.1
13.09.2021  00:48             1 109 1.1.1.txt
13.09.2021  00:21    <DIR>          1.2
13.09.2021  00:33    <DIR>          1.3
27.09.2021  01:22               110 2709.bat
19.09.2021  09:28    <DIR>          proj1
19.09.2021  09:19    <DIR>          template
13.09.2021  00:50             1 153 дз.txt
               4 файлов          2 372 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\1.1

13.09.2021  00:22    <DIR>          .
13.09.2021  00:22    <DIR>          ..
13.09.2021  00:22                42 1.1.1.txt
               1 файлов             42 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\1.2

13.09.2021  00:21    <DIR>          .
13.09.2021  00:21    <DIR>          ..
               0 файлов              0 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\1.3

13.09.2021  00:33    <DIR>          .
13.09.2021  00:33    <DIR>          ..
               0 файлов              0 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\proj1

19.09.2021  09:28    <DIR>          .
19.09.2021  09:28    <DIR>          ..
19.09.2021  09:14                17 readme
19.09.2021  09:45    <DIR>          src
               1 файлов             17 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\proj1\src

19.09.2021  09:45    <DIR>          .
19.09.2021  09:45    <DIR>          ..
19.09.2021  09:45                 6 code
19.09.2021  09:21                 6 temlate.code
               2 файлов             12 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\template

19.09.2021  09:19    <DIR>          .
19.09.2021  09:19    <DIR>          ..
19.09.2021  09:14                17 readme
19.09.2021  09:21    <DIR>          src
               1 файлов             17 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\template\src

19.09.2021  09:21    <DIR>          .
19.09.2021  09:21    <DIR>          ..
19.09.2021  09:21                 6 temlate.code
               1 файлов              6 байт

     Всего файлов:
              10 файлов          2 466 байт
              23 папок  443 860 123 648 байт свободно
02.10.2021 
echo Hi!echo Hi!Hi!
 ’®¬ ў гбва®©бвўҐ C ­Ґ Ё¬ҐҐв ¬ҐвЄЁ.
 ‘ҐаЁ©­л© ­®¬Ґа в®¬ : 08B4-FC69

 ‘®¤Ґа¦Ё¬®Ґ Ї ЇЄЁ C:\Users\NasSm\¤§ Ї® нў¬

13.09.2021  00:48    <DIR>          .
13.09.2021  00:48    <DIR>          ..
13.09.2021  00:22    <DIR>          1.1
13.09.2021  00:48                 0 1.1.1.txt
13.09.2021  00:21    <DIR>          1.2
13.09.2021  00:33    <DIR>          1.3
               1 д ©«®ў              0 Ў ©в

 ‘®¤Ґа¦Ё¬®Ґ Ї ЇЄЁ C:\Users\NasSm\¤§ Ї® нў¬\1.1

13.09.2021  00:22    <DIR>          .
13.09.2021  00:22    <DIR>          ..
13.09.2021  00:22                42 1.1.1.txt
               1 д ©«®ў             42 Ў ©в

 ‘®¤Ґа¦Ё¬®Ґ Ї ЇЄЁ C:\Users\NasSm\¤§ Ї® нў¬\1.2

13.09.2021  00:21    <DIR>          .
13.09.2021  00:21    <DIR>          ..
               0 д ©«®ў              0 Ў ©в

 ‘®¤Ґа¦Ё¬®Ґ Ї ЇЄЁ C:\Users\NasSm\¤§ Ї® нў¬\1.3

13.09.2021  00:33    <DIR>          .
13.09.2021  00:33    <DIR>          ..
               0 д ©«®ў              0 Ў ©в

     ‚бҐЈ® д ©«®ў:
               2 д ©«®ў             42 Ў ©в
              11 Ї Ї®Є  447я858я741я248 Ў ©в бў®Ў®¤­®
 Том в устройстве C не имеет метки.
 Серийный номер тома: 08B4-FC69

 Содержимое папки C:\Users\NasSm\дз по эвм

02.10.2021  18:20    <DIR>          .
02.10.2021  18:20    <DIR>          ..
02.10.2021  18:24             2 388 02.10.1.txt
13.09.2021  00:22    <DIR>          1.1
13.09.2021  00:48             1 109 1.1.1.txt
13.09.2021  00:21    <DIR>          1.2
13.09.2021  00:33    <DIR>          1.3
27.09.2021  01:22               110 2709.bat
19.09.2021  09:28    <DIR>          proj1
19.09.2021  09:19    <DIR>          template
13.09.2021  00:50             1 153 дз.txt
               4 файлов          4 760 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\1.1

13.09.2021  00:22    <DIR>          .
13.09.2021  00:22    <DIR>          ..
13.09.2021  00:22                42 1.1.1.txt
               1 файлов             42 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\1.2

13.09.2021  00:21    <DIR>          .
13.09.2021  00:21    <DIR>          ..
               0 файлов              0 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\1.3

13.09.2021  00:33    <DIR>          .
13.09.2021  00:33    <DIR>          ..
               0 файлов              0 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\proj1

19.09.2021  09:28    <DIR>          .
19.09.2021  09:28    <DIR>          ..
19.09.2021  09:14                17 readme
19.09.2021  09:45    <DIR>          src
               1 файлов             17 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\proj1\src

19.09.2021  09:45    <DIR>          .
19.09.2021  09:45    <DIR>          ..
19.09.2021  09:45                 6 code
19.09.2021  09:21                 6 temlate.code
               2 файлов             12 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\template

19.09.2021  09:19    <DIR>          .
19.09.2021  09:19    <DIR>          ..
19.09.2021  09:14                17 readme
19.09.2021  09:21    <DIR>          src
               1 файлов             17 байт

 Содержимое папки C:\Users\NasSm\дз по эвм\template\src

19.09.2021  09:21    <DIR>          .
19.09.2021  09:21    <DIR>          ..
19.09.2021  09:21                 6 temlate.code
               1 файлов              6 байт

     Всего файлов:
              10 файлов          4 854 байт
              23 папок  443 860 168 704 байт свободно
"Hi!" 
@echo off 
for %%j in (%pathext%) do (for %%i in ("%path:;=" "%") do (for %%k in (%%i*%%j) do (echo %%~nk) ))@echo off
setlocal  enabledelayedexpansion

set string=

for /L %%i in (1,1,%1) do (
	for /L %%k in (1,1,%%i) do (
		set string=!string!*
	)
	echo !string!
	set string=
) ’®¬ ў гбва®©бвўҐ C ­Ґ Ё¬ҐҐв ¬ҐвЄЁ.
 ‘ҐаЁ©­л© ­®¬Ґа в®¬ : 08B4-FC69

 ‘®¤Ґа¦Ё¬®Ґ Ї ЇЄЁ C:\Users\NasSm\¤§ Ї® нў¬

13.09.2021  00:50    <DIR>          .
13.09.2021  00:50    <DIR>          ..
13.09.2021  00:22    <DIR>          1.1
13.09.2021  00:48             1я109 1.1.1.txt
13.09.2021  00:21    <DIR>          1.2
13.09.2021  00:33    <DIR>          1.3
13.09.2021  00:50                 0 ¤§.txt
               2 д ©«®ў          1я109 Ў ©в

 ‘®¤Ґа¦Ё¬®Ґ Ї ЇЄЁ C:\Users\NasSm\¤§ Ї® нў¬\1.1

13.09.2021  00:22    <DIR>          .
13.09.2021  00:22    <DIR>          ..
13.09.2021  00:22                42 1.1.1.txt
               1 д ©«®ў             42 Ў ©в

 ‘®¤Ґа¦Ё¬®Ґ Ї ЇЄЁ C:\Users\NasSm\¤§ Ї® нў¬\1.2

13.09.2021  00:21    <DIR>          .
13.09.2021  00:21    <DIR>          ..
               0 д ©«®ў              0 Ў ©в

 ‘®¤Ґа¦Ё¬®Ґ Ї ЇЄЁ C:\Users\NasSm\¤§ Ї® нў¬\1.3

13.09.2021  00:33    <DIR>          .
13.09.2021  00:33    <DIR>          ..
               0 д ©«®ў              0 Ў ©в

     ‚бҐЈ® д ©«®ў:
               3 д ©«®ў          1я151 Ў ©в
              11 Ї Ї®Є  447я857я344я512 Ў ©в бў®Ў®¤­®
